# MIT License
#
# Copyright (c) 2023 AnonymousX1025
#
# Permission is hereby granted, free of charge, to any person obtaining a copy
# of this software and associated documentation files (the "Software"), to deal
# in the Software without restriction, including without limitation the rights
# to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# copies of the Software, and to permit persons to whom the Software is
# furnished to do so, subject to the following conditions:
#
# The above copyright notice and this permission notice shall be included in all
# copies or substantial portions of the Software.
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
# SOFTWARE.

from FallenMusic import BOT_NAME

PM_START_TEXT = """
‌‌‏

 اهــلا بـك » {0}

 انـا بــوت » {1}

 اســتـطـيـع تـشـغـيـل الاغــاني 

 فــي الــــــمــــكـــالــمــات الــصــوتــيـــة

 تـابـع الازرار بـالاسفل لـمعرفة الاوامـࢪ

‌‌‏
"""

START_TEXT = """
‏
 مـرحـبـا » {0} 
 انا بـوت سورس نجد للتـشـغيـل
 الميوزك في المكالمه الصوتيه 
 لـمـعـرفة اوامـر الـتـشـغـيـل
 ادخـــــــل الـــــى البــــــوت
━‌‌‏─━─‌‌𝒔𝒐𝒖𝒓𝒄𝒆 𝒏𝒂𝒋𝒅 🇸🇦─━─━‌‌‏
"""

HELP_TEXT = f"""
<u> **الاوامر في بوت سورس نجد {BOT_NAME} :**</u>

 لـتـشـغـيل اغنيه في الـمكـالـمة الـصـوتـيـة
 اكتب تشغيل + اسم الاغنيه 

 لإيقاف التشغيل في المكالمه مؤقتاً
 اكتب كتم او اسكت

 لأسـتـئـنـاف الـتـشغـيل في المكالمه 
 اكتب كمل او الغاء الكتم

 للتخطي وتـشغـيل الاغنيه الـتالـية
 اكتب تخطي او التالي
 
 لإيـقـاف الـتـشـغـيـل فـي المكالمه 
 اكتب ايقاف او قف

 اكتب بنج لمعرفة سرعة تشغيل البوت
 اكتب المطورين لمعرفة مطورين البوت
 اكتب تحميل + الاسم للتنزيل من اليوتيوب
 اكتب بحث + الاسم للبحث عن اغنية
"""

HELP_SUDO = f"""
<u> **اوامر المطور {BOT_NAME} :**</u>

 اكتب المكالمات لمعرفة المكالمات في البوت
 اكتب /eval لتشغيل على محطة البوت 
 اكتب فحص لاختبار سرعة السيرفر  
 اكتب الاحصائيات لعرض إحصائيات السيرفر 

 اكتب /اسم + الاسم لوضعة اسم للمساعد
 اكتب /بايو + البايو لوضعة بايو للمساعد
 اكتب /صورة واعمل ريب على صورة للمساعد
 اكتب /مسح لحذف صورة الحساب المساعد 
"""

HELP_DEV = f"""
<u> **Dev🏅  {BOT_NAME} :**</u>

 اكتب الفارات لجلب فارات تنصيب البوت
 اكتب اذاعة و اعمل ريب على الاذاعه
 اكتب تنظيف لمسح التخزين المؤقت للبوت
 اكتب مغادرة لمغادرة المساعد للجروبات

 اكتب /مطور +اليوزر لإضافة مطور في البوت
 اكتب /تنزيل +اليوزر لـتـنزيل مطور من البوت
"""
